In [ ]:
import pandas as pd
import numpy as np
import tensorflow as tf
from tensorflow import keras
from tensorflow.keras import layers, Sequential
from tensorflow.keras.layers import Dense,Flatten

In [24]:
df = pd.read_csv(r'D:\Deep Learning\Artificial_Neuron_Network (ANN)\Customer_Churn_Modelling.csv')
df

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,9996,15606229,Obijiaku,771,France,Male,39,5,0.00,2,1,0,96270.64,0
9996,9997,15569892,Johnstone,516,France,Male,35,10,57369.61,1,1,1,101699.77,0
9997,9998,15584532,Liu,709,France,Female,36,7,0.00,1,0,1,42085.58,1
9998,9999,15682355,Sabbatini,772,Germany,Male,42,3,75075.31,2,1,0,92888.52,1
9999,10000,15628319,Walker,792,France,Female,28,4,130142.79,1,1,0,38190.78,0

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        10000 non-null  int64
 1   CustomerId       10000 non-null  int64
 2   Surname          10000 non-null  object
 3   CreditScore      10000 non-null  int64
 4   Geography        10000 non-null  object
 5   Gender           10000 non-null  object
 6   Age              10000 non-null  int64
 7   Tenure           10000 non-null  int64
 8   Balance          10000 non-null  float64
 9   NumOfProducts    10000 non-null  int64
 10  HasCrCard        10000 non-null  int64
 11  IsActiveMember   10000 non-null  int64
 12  EstimatedSalary  10000 non-null  float64
 13  Exited           10000 non-null  int64
dtypes: float64(2), int64(9), object(3)
memory usage: 1.1+ MB

In [26]:
df.isnull().sum()

RowNumber          0
CustomerId         0
Surname            0
CreditScore        0
Geography          0
Gender             0
Age                0
Tenure             0
Balance            0
NumOfProducts      0
HasCrCard          0
IsActiveMember     0
EstimatedSalary    0
Exited             0
dtype: int64

### Categorical Value
- Geography
- Gender
- Surname

In [27]:
df['Geography'].unique()

array(['France', 'Spain', 'Germany'], dtype=object)

In [28]:
df['Surname'].unique()

array(['Hargrave', 'Hill', 'Onio', ..., 'Kashiwagi', 'Aldridge',
       'Burbidge'], shape=(2932,), dtype=object)

In [29]:
df['Gender'].unique()

array(['Female', 'Male'], dtype=object)

### Encoding Categorical Value

In [30]:
df['Geography'] = df['Geography'].map({'France': 0, 'Spain': 1, 'Germany': 2})
df['Gender'] = df['Gender'].map({'Female': 0, 'Male': 1})

In [31]:
df

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,0,0,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,1,0,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,0,0,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,0,0,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,1,0,43,2,125510.82,1,1,1,79084.10,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,9996,15606229,Obijiaku,771,0,1,39,5,0.00,2,1,0,96270.64,0
9996,9997,15569892,Johnstone,516,0,1,35,10,57369.61,1,1,1,101699.77,0
9997,9998,15584532,Liu,709,0,0,36,7,0.00,1,0,1,42085.58,1
9998,9999,15682355,Sabbatini,772,2,1,42,3,75075.31,2,1,0,92888.52,1
9999,10000,15628319,Walker,792,0,0,28,4,130142.79,1,1,0,38190.78,0

In [32]:
X = df.drop(['RowNumber', 'CustomerId', 'Surname', 'Exited'], axis=1)
y = df['Exited']

In [33]:
X

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
0,619,0,0,42,2,0.00,1,1,1,101348.88
1,608,1,0,41,1,83807.86,1,0,1,112542.58
2,502,0,0,42,8,159660.80,3,1,0,113931.57
3,699,0,0,39,1,0.00,2,0,0,93826.63
4,850,1,0,43,2,125510.82,1,1,1,79084.10
...,...,...,...,...,...,...,...,...,...,...
9995,771,0,1,39,5,0.00,2,1,0,96270.64
9996,516,0,1,35,10,57369.61,1,1,1,101699.77
9997,709,0,0,36,7,0.00,1,0,1,42085.58
9998,772,2,1,42,3,75075.31,2,1,0,92888.52
9999,792,0,0,28,4,130142.79,1,1,0,38190.78

In [34]:
y

0       1
1       0
2       1
3       0
4       0
       ..
9995    0
9996    0
9997    1
9998    1
9999    0
Name: Exited, Length: 10000, dtype: int64

### Splitting data into training and testing data

In [35]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42 , stratify=y)

In [36]:
X_train

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
2151,753,0,1,57,7,0.00,1,1,0,159475.08
8392,739,2,1,32,3,102128.27,1,1,0,63981.37
5006,755,2,0,37,0,113865.23,2,1,1,117396.25
4117,561,0,1,37,5,0.00,2,1,0,83093.25
7182,692,2,1,49,6,110540.43,2,0,1,107472.99
...,...,...,...,...,...,...,...,...,...,...
4555,688,1,0,35,6,0.00,1,1,0,25488.43
4644,712,1,1,74,5,0.00,2,0,0,151425.82
8942,667,0,0,37,9,71786.90,2,1,1,67734.79
2935,687,1,1,35,8,100988.39,2,1,0,22247.27
6206,802,1,1,51,7,0.00,1,0,1,40855.79

### Normalization

In [44]:
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
X_train = scaler.fit_transform(X_train)
X_test = scaler.transform(X_test)

In [46]:
X_train

array([[ 1.058568  , -0.90601518,  0.90750738, ...,  0.64104192,
        -1.030206  ,  1.04208392],
       [ 0.91362605,  1.50520287,  0.90750738, ...,  0.64104192,
        -1.030206  , -0.62355635],
       [ 1.07927399,  1.50520287, -1.10191942, ...,  0.64104192,
         0.97067965,  0.30812779],
       ...,
       [ 0.16821031, -0.90601518, -1.10191942, ...,  0.64104192,
         0.97067965, -0.55808767],
       [ 0.37527024,  0.29959384,  0.90750738, ...,  0.64104192,
        -1.030206  , -1.35149956],
       [ 1.56586482,  0.29959384,  0.90750738, ..., -1.55996038,
         0.97067965, -1.02692216]], shape=(8000, 10))

In [47]:
X_test

array([[-0.66718803, -0.88901093,  0.93228691, ...,  0.66636576,
        -1.03252879, -0.1245155 ],
       [-1.28654133,  1.50886076,  0.93228691, ..., -1.50067735,
        -1.03252879, -0.79840989],
       [-0.95621957,  0.30992491, -1.07263117, ..., -1.50067735,
         0.968496  ,  0.06712409],
       ...,
       [-1.37944433,  1.50886076, -1.07263117, ..., -1.50067735,
        -1.03252879,  0.82644477],
       [ 0.4063577 , -0.88901093,  0.93228691, ..., -1.50067735,
        -1.03252879, -1.48855742],
       [ 1.03603357, -0.88901093,  0.93228691, ...,  0.66636576,
        -1.03252879, -0.51894491]], shape=(2000, 10))

### Build ANN

In [53]:
model = Sequential()
model.add(Dense(16, activation='sigmoid'))
model.add(Dense(8, activation='sigmoid'))
model.add(Dense(1, activation='sigmoid'))

In [54]:
model.compile(optimizer='adam', loss='binary_crossentropy', metrics=['accuracy'])

In [55]:
model.fit(X_train, y_train.to_numpy(), epochs=11, batch_size=10,verbose=1)

Epoch 1/11
800/800 ━━━━━━━━━━━━━━━━━━━━ 2s 794us/step - accuracy: 0.7685 - loss: 0.5083
Epoch 2/11
800/800 ━━━━━━━━━━━━━━━━━━━━ 1s 796us/step - accuracy: 0.8004 - loss: 0.4453
Epoch 3/11
800/800 ━━━━━━━━━━━━━━━━━━━━ 1s 811us/step - accuracy: 0.8135 - loss: 0.4300
Epoch 4/11
800/800 ━━━━━━━━━━━━━━━━━━━━ 1s 807us/step - accuracy: 0.8146 - loss: 0.4250
Epoch 5/11
800/800 ━━━━━━━━━━━━━━━━━━━━ 1s 829us/step - accuracy: 0.8204 - loss: 0.4216
Epoch 6/11
800/800 ━━━━━━━━━━━━━━━━━━━━ 1s 812us/step - accuracy: 0.8244 - loss: 0.4169
Epoch 7/11
800/800 ━━━━━━━━━━━━━━━━━━━━ 1s 791us/step - accuracy: 0.8292 - loss: 0.4116
Epoch 8/11
800/800 ━━━━━━━━━━━━━━━━━━━━ 1s 828us/step - accuracy: 0.8331 - loss: 0.4058
Epoch 9/11
800/800 ━━━━━━━━━━━━━━━━━━━━ 1s 799us/step - accuracy: 0.8367 - loss: 0.3999
Epoch 10/11
800/800 ━━━━━━━━━━━━━━━━━━━━ 1s 842us/step - accuracy: 0.8388 - loss: 0.3946
Epoch 11/11
800/800 ━━━━━━━━━━━━━━━━━━━━ 1s 851us/step - accuracy: 0.8404 - loss: 0.3893